perf/metar_slow.yaml
config:
  target: "{{ $processEnvironment.TARGET }}"
  plugins:
    publish-metrics:
      - type: datadog
        apiKey: "{{ $processEnvironment.DATADOG_API_KEY }}"
        prefix: "artillery."
        tags:
          - "test:metar"

  phases:
    - name: Pause
      pause: 5
    - name: Plain
      duration: 120
      arrivalRate: 1
  variables:
    station:
      - 'SAEZ'
      - 'KSFO'
      - 'KJFK'
      - 'EGLL'
      - 'OMDB'

scenarios:
  - name: Metar (/metar)
    flow:
      - get:
          url: '/metar'
          qs: 
            station: '{{ station }}'